const newsData={
//21世紀 20010101~21001231
year21:[

{
title:"2024年3月15日，升格為國定古蹟。",
date:"2024(民國113年)",
category:""
},

{
title:"2022年10月，燈塔預防停電，自行供電發電機更新。",
date:"2022(民國111年)",
category:""
},

{
title:"2022年6月，屏東縣文化資產保護所將鵝鑾鼻燈塔登錄為縣定古蹟",
date:"2022(民國111年)",
category:""
},

{
title:"2020年7月，全中運聖火鵝鑾鼻燈塔點燃。",
date:"2020(民國109年)",
category:""
},

{
title:"2017年06月，塔身已經鏽蝕，燈塔要展開瘦身美容大作戰，要先刮除外層舊漆，再重新上漆，讓百歲的燈塔重現風華。",
date:"2017(民國106年)",
category:""
},

{
title:"2016年，於園區附近發現廢棄日晷基腳、臺灣關界碑、清代臨時燈及氣象塔遺址。",
date:"2016(民國105年)",
category:""
},

{
title:"2013年，財政部關稅總局整併財政部關政司，成立財政部關務署，並將燈塔及助航設備業務移交交通部航港局管轄。",
date:"2013(民國102年)",
category:""
}

],
//20世紀 19000101~20001231
year20:[

{
title:"1996年10月5日，臺灣區運於鵝鑾鼻燈塔使用雷射光束引燃聖火。",
date:"1996(民國85年)",
category:""
},

{
title:"1992年1月10日，鵝鑾鼻燈塔正式關放民眾參觀。",
date:"1992(民國81年)",
category:""
},

{
title:"1984年，墾丁國家公園管理處成立，是我國第一座國家公園。",
date:"1984(民國73年)",
category:""
},

{
title:"1979年，我國退出國際燈塔組織。",
date:"1979(民國68年)",
category:""
},

{
title:"1962年，修改塔頂、塔門並拆除圍牆。",
date:"1962(民國51年)",
category:""
},

{
title:"1962年，將燈器換裝新式大型四等迴轉透鏡電燈，每４秒一閃，光力高達１８０００００支燭光。",
date:"1962(民國51年)",
category:""
},

{
title:"1955，恆春發生強烈地震，燈塔圍牆倒塌３０公尺。",
date:"1955(民國44年)",
category:""
},

{
title:"1948年5月，財政部臺北關稅務司公署公告，將原有之電石氣燈撤去，改裝五等直流電關光燈器。",
date:"1948(民國37年)",
category:""
},

{
title:"1947年，二次大戰時燈器遭盟機炸損，光復後海關改修燈器，暫裝六等電石氣光燈臨時燈。",
date:"1947(民國36年)",
category:""
},

{
title:"1926年，臺灣燈塔業務轉由總督府交通部遞信部負責。",
date:"1926(大正15年)",
category:""
},

{
title:"1918年，本年度廢止沿岸船隻停靠鵝鑾鼻。",
date:"1918(大正7年)",
category:""
},

{
title:"1914年，沿岸船隻唯有出具通信局通知或燈臺發出信號才能停靠鵝鑾鼻。",
date:"1914(大正3年)",
category:""
},

{
title:"1914年10月生番作亂，枋山、車城、恆春均受害。",
date:"1914(大正3年)",
category:""
},

{
title:"1912年，開始處理船舶通報相關事務，但不包括夜間通過的信號。",
date:"1912年（大正1年）",
category:""
},

{
title:"1910年，撤去多德式五重芯火口，換上路克斯石油蒸發白熱燈器，光力２萬６千燭光",
date:"1910 年（明治 43 年）",
category:""
},

{
title:"1909年，洋式燈塔建造進入[維護期]，以白熾紗罩燈器取代多環燈心，且改用煤油蒸氣，使燈塔燭光增強。",
date:"1909 年（明治 42 年）",
category:""
},

{
title:"1902年，為了燈臺交通，將船隻停靠地由南灣變更為鵝鑾鼻。",
date:"1902（明治 35 年）",
category:""
}

],

year19:[

{
title:"1898年12月，恆春間電話線遭土匪生番切斷，爾後此地便有警官派駐。",
date:"1898(明治31年)",
category:""
},

{
title:"1898年5月，點燈開始濃霧警報。",
date:"1898(明治31年)",
category:""
},

{
title:"1898年3月，修繕完成，移交通信課管理",
date:"1898(明治31年)",
category:""
},

{
title:"11月，恆春電話開通",
date:"1897(明治30年)",
category:""
},

{
title:"7月，台灣總督府土木課著手修繕燈塔",
date:"1897(明治30年)",
category:""
},

{
title:"洋式燈塔建造進入[全盛期]，由海事課接管燈塔事務。",
date:"1896(明治29年)",
category:""
},

{
title:"清廷與日本簽訂[馬關條約]，割讓臺灣、澎湖及其附屬島嶼予日本。施行燈臺所管制，由臺灣總督管理掌理航路、標誌事務等相關規定。",
date:"1895(光緖21年)",
category:""
},

{
title:"英國及其他外國人離臺後，清兵掠奪鵝鑾鼻燈塔，並堆放火藥、石油等物進行爆破。",
date:"1895(光緖21年)",
category:""
},

{
title:"1894年，甲午戰爭爆發。",
date:"1894(光緖20年)",
category:""
},

{
title:"1883年12月，中法戰役爆發。",
date:"1883(光緒9年)",
category:""
},

{
title:"1883年12月，牆上的槍孔及外圍戰壕，皆是為了防備原住民而建置，是臺灣第一座也是世界首見附設銃眼並設有格林砲的鐵板造武裝燈塔。",
date:"1883(光緒9年)",
category:""
},

{
title:"1883年，鵝鑾鼻燈塔在現址完工，４月１日啟用。",
date:"1883(光緒9年)",
category:""
},

{
title:"1881年，在岬角的珊瑚岩上建置燈樓港及臨時的六級燈塔。",
date:"1881(光緒7年)",
category:""
},

{
title:"1875年，清將王福祿於距離鵝鑾鼻燈塔現址西南方的岩石上，設立高約１０尺的臨時燈，是為鵝鑾鼻燈塔之始。",
date:"1875(光緒元年)",
category:""
},

{
title:"1875年，並前往安平拜託洽記商會經營者黑斯清出資建燈臺；同年購買土地準備建構造燈塔。",
date:"1875(光緒元年)",
category:""
},

{
title:"1874年，因八瑤灣事件而起，日本發動［征臺之役］，也就是［牡丹社事件］。此後清廷才開始將建設燈塔視為臺灣政策要務。",
date:"1874(同治13年)",
category:""
},

{
title:"1871年11月，琉球貢船在朝頁歸途中，遭遇暴風雨侵襲，流漂到今日滿州鄉八瑤灣處，遭高士佛社原住民殺害，史稱［八瑤灣事件］。該事件後，日本政府迫清廷在臺灣南部建造燈塔。",
date:"1871(同治10年)",
category:""
},

{
title:"1869年，韓得善進海關任燈塔營造司，為中國沿海燈塔設計監造前後長達３０年，燈塔建造進入［初創期］",
date:"1869(同治8年)",
category:""
},

{
title:"1867年3月9日，美國商船羅發號因暴風漂流至鵝鑾鼻西南附近觸礁沉沒，船長船員在龜仔鼻山登陸後遭原住民殺害，美國領事李仙得因此提出建造燈塔之議。",
date:"1867(同治6年)",
category:""
},

{
title:"1858年，英法聯軍後，中英簽訂<＜天津條約＞＞，第３２條追規定:［通商各口分設浮樁、號船、塔表、望樓，由領事官與地方官會同酌視建造。",
date:"1858(咸豐8年)",
category:""
},

{
title:"1842年，鴉片戰爭戰敗，與英國簽訂<＜江寧條約＞＞，開放五港通商，助航設施成為當務之急。",
date:"1842(道光22年)",
category:""
},

{
title:"1840年6月，中英鴉片戰爭。",
date:"1840(道光20年)",
category:""
}


]

};

const newsList=document.getElementById("newsList");

function render(tab){

    newsList.innerHTML="";

    newsData[tab].forEach(item=>{

        newsList.innerHTML+=`

        <div class="news-item">

            <div class="news-title">

                ${item.title}

            </div>

            <div class="news-info">

                <span class="category">

                    ${item.category}

                </span>

                <span>

                    ${item.date}

                </span>

            </div>

        </div>

        `;

    });

}

render("year21");

document.querySelectorAll(".tab").forEach(button=>{

    button.onclick=()=>{

        document.querySelector(".tab.active").classList.remove("active");

        button.classList.add("active");

        render(button.dataset.tab);

    };

});